app/controllers/reports_controller.rb

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 6]]
---
  def show
    id = params[:id] # retrieve report ID from URI route
    @report = Report.find(id) # look up report by unique ID

SELECT "reports".* FROM "reports" WHERE "reports"."status" = ?  [["status", "Uncompleted"]]
SELECT "reports".* FROM "reports"
---
  def index
    @completed_checked = params[:show_complete]
    @emer_only_checked = params[:emer_only]

    @reports = Report.where(status: "Uncompleted")

    puts params

    if !params[:show_complete].nil?
      @reports = Report
    end

    if !params[:emer_only].nil?
      @reports = @reports.where(emergencylevel: "Urgent")
      puts @reports
    end

    if @reports == Report
      @reports = Report.all

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @report = Report.find params[:id]

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "reports" SET "status" = ? WHERE "reports"."id" = ?  [["status", "Completed"], ["id", 6]]
---
  def complete
    report = Report.find params[:id]
    flash[:notice] = "Marked as complete successful"
    report.status = "Completed"

    if report.save

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "reports" SET "building" = ?, "area" = ?, "problemtype" = ?, "description" = ?, "file" = ? WHERE "reports"."id" = ?  [["building", "Hartley Hall"], ["area", "First Floor Lounge"], ["problemtype", "Other"], ["description", "pool table broken"], ["file", "截屏2022-11-12_上午9.56.48.png"], ["id", 1]]
---
  def update
    @report = Report.find params[:id]
    @report.update_attributes!(report_params)